{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "fifteen-sailing",
   "metadata": {},
   "source": [
    "# Набор заданий №3\n",
    "\n",
    "### Задание 1\n",
    "В Тридевятом Царстве уже много лет как установилась конституционная монархия. В парламент Тридевятого царства входят 26 партий, обозначаемых строчными буквами английского алфавита от «a» до «z». Заседание парламента в соответствии с регламентом проходит по следующей схеме:\n",
    "- В начале заседания никаких законопроектов на повестке дня не стоит.\n",
    "- Любая партия (в том числе и та, которая внесла текущий законопроект) в любой момент времени может внести на обсуждение новый законопроект.\n",
    "- При вносе партией нового законопроекта обсуждение предыдущего приостанавливается и начинается обсуждение нового. После того, как парламентарии голосуют за новый законопроект, обсуждение законопроекта, прерванного им, продолжается.\n",
    "- Дискуссия по любому законопроекту обязана завершиться голосованием по этому законопроекту.\n",
    "- В конце заседания не должно остаться внесённых законопроектов, дискуссия по которым не завершена.\n",
    "\n",
    "Вам дана запись о событиях на сессии парламента. Каждое событие является либо внесением нового законопроекта, либо голосованием за какой-то законопроект, причём в обоих случаях известен номер партии, этот законопроект предложившей. События даны в том порядке, в котором они происходили. Проверьте, может ли данная запись о событиях соответствовать какому-либо заседанию, удовлетворяющему порядку проведения, описанному выше.\n",
    "#### Ввод\n",
    "Первая строка входных данных содержит одно целое число *K* – количество строк в записи сессии (1 ≤ *K* ≤ 1000). Каждая строка соответствует одному из двух событий:\n",
    "\n",
    "- Add *x* – партия x внесла на голосование законопроект.\n",
    "- Vote *x* – прошло голосование за документ, внесённый партией *x*.\n",
    "\n",
    "Здесь *x* – строчная буква английского алфавита от «a» до «z», задающая партию.\n",
    "#### Вывод\n",
    "Выведите «Yes», если существует корректный порядок проведения заседания, который мог привести к такой записи, и «No», если ни при каком корректном порядке проведения заседания данная запись появиться не могла."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "8ce54b53",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "введите К 8\n",
      "Add c\n",
      "Add a\n",
      "Add b\n",
      "Vote b\n",
      "Vote a\n",
      "Add a\n",
      "Vote a\n",
      "Vote c\n",
      "Yes\n"
     ]
    }
   ],
   "source": [
    "k = int(input('введите К '))\n",
    "queue = []\n",
    "ok = True \n",
    "for i in range (k): \n",
    "    s = input() \n",
    "    if ok == True: \n",
    "        if s[0] == 'A': \n",
    "            queue.append(s[4]) \n",
    "        else: \n",
    "            if queue[len(queue) -1] == s[5]: \n",
    "                queue.pop() \n",
    "            else: ok = False \n",
    "if queue:\n",
    "    ok = False\n",
    "if ok:\n",
    "    print('Yes')\n",
    "else:\n",
    "    print('No')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "controversial-location",
   "metadata": {},
   "source": [
    "### Задача 2. Правильный подмногоугольник\n",
    "\n",
    "Задан правильный *N*-угольник. Требуется выбрать наименьшее количество его вершин, которые также образуют правильный многоугольник.\n",
    "\n",
    "#### Входные данные\n",
    "\n",
    "Входные данные содержат одно целое число *N* (3 ≤ *N* ≤ 1012).\n",
    "\n",
    "#### Вывод\n",
    "\n",
    "Выведите одно число — наименьшее количество вершин заданного многоугольника, которые образуют правильный многоугольник."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "id": "coated-highway",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите N 884\n",
      "52\n"
     ]
    }
   ],
   "source": [
    "from sympy import *\n",
    "n = int(input('Введите N '))\n",
    "max_div = 1\n",
    "for i in range(n - 1,1,-1):\n",
    "    counter = 0\n",
    "    if n % i == 0:\n",
    "        for j in range(i - 1, 1, -1):\n",
    "            if (i % j == 0):\n",
    "                counter = counter + 1\n",
    "        if ((counter == 0) and (max_div < i) and (n // i > 2)):\n",
    "            max_div = i\n",
    "print(n // max_div)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cordless-fundamentals",
   "metadata": {},
   "source": [
    "### Задача 3.\n",
    "\n",
    "На форуме, на котором обсуждаются задачи олимпиад по информатике, ввели следующий аналог капчи. Участнику выдаётся строка из *N* десятичных цифр (без ведущих нулей). В качестве ответа требуется ввести такое основание системы счисления *B*, что в этой системе счисления выданная запись будет соответствовать составному числу (назовем его *D*), а также число *X*, большее 1 и меньшее *D*, являющееся делителем *D*.\n",
    "\n",
    "При этом *B* и *X* не должны превосходить 10^9.\n",
    "\n",
    "По заданной строке десятичных цифр найдите любую пару чисел *B* и *X*, удовлетворяющую ограничениям, или ответьте, что решения в заданных ограничениях не существует.\n",
    "\n",
    "#### Входные данные\n",
    "\n",
    "Входные данные состоят из непустой строки длиной до 3 ⋅ 106 символов, составленной из цифр от 0 до 9 и не начинающейся с 0.\n",
    "\n",
    "#### Вывод\n",
    "\n",
    "Если решение существует, выведите два числа – основание системы счисления *B* и делитель *X*, записанные в десятичной системе счисления. Оба числа должны удовлетворять ограничениям 2 ≤ *B*, *X* ≤ 10^9. Если решения не существует, выведите –1."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "jewish-rocket",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите строку 4312\n",
      "5 2\n"
     ]
    }
   ],
   "source": [
    "from sympy import *\n",
    "\n",
    "def to_10 (a: str, ss: int) -> int:\n",
    "    ans = 0\n",
    "    for i in range (0, len(a)):\n",
    "        ans += int(a[i])*pow(ss, len(a)-i-1)\n",
    "    return ans\n",
    "\n",
    "\n",
    "n = input('Введите строку ')\n",
    "fl = True\n",
    "max_num = -1\n",
    "for i in range (len(n)):\n",
    "    if int(n[i]) > max_num:\n",
    "        max_num = int(n[i])\n",
    "for ss in range (max_num+1, 1000000000):\n",
    "    if ss % 1000000 == 0:\n",
    "        print (ss)\n",
    "    if not fl:\n",
    "        break\n",
    "    n_10 = to_10(n, ss)\n",
    "    if not isprime(n_10):\n",
    "        for i in range (2, n_10-1):\n",
    "            if n_10 % i == 0:\n",
    "                print (ss, i)\n",
    "                fl = False\n",
    "                break\n",
    "if fl:\n",
    "    print (-1)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
